In [1]:
## 인덱싱, lioc(), loc()

In [3]:
import pandas as pd
import numpy as np
df = pd.DataFrame( {
    '이름': ['피카츄','라이츄','리자드','리자몽','꼬부기','어니부기'],
    '속성': ['전기', '전기', '불','불','물',None], 
    '색깔': ['노랑', '노랑', None,'빨강','파랑','파랑'],
    '순위': [ 5, 2, 6, 1, 4, 3] })

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      6 non-null      object
 1   속성      5 non-null      object
 2   색깔      5 non-null      object
 3   순위      6 non-null      int64
dtypes: int64(1), object(3)
memory usage: 320.0+ bytes

In [ ]:
# 열 인덱싱 by 열 이름
df['이름']

0     피카츄
1     라이츄
2     리자드
3     리자몽
4     꼬부기
5    어니부기
Name: 이름, dtype: object

In [7]:
df[['이름']]

     이름
0   피카츄
1   라이츄
2   리자드
3   리자몽
4   꼬부기
5  어니부기

In [9]:
df[['이름', '색깔']]

     이름    색깔
0   피카츄    노랑
1   라이츄    노랑
2   리자드  None
3   리자몽    빨강
4   꼬부기    파랑
5  어니부기    파랑

In [10]:
# 행인덱싱 by 슬라이싱
df[3:4]

    이름 속성  색깔  순위
3  리자몽  불  빨강   1

In [11]:
df[1:3]

    이름  속성    색깔  순위
1  라이츄  전기    노랑   2
2  리자드   불  None   6

In [12]:
# 불리언 인덱싱
df[df['색깔']=='노랑']

    이름  속성  색깔  순위
0  피카츄  전기  노랑   5
1  라이츄  전기  노랑   2

In [14]:
df[(df['순위']>3) & (df['색깔']=='노랑')]

    이름  속성  색깔  순위
0  피카츄  전기  노랑   5

In [ ]:
# iloc 로 행 가져오기 by 행의 인덱스 번호로 인덱싱
df.iloc[0]

이름    피카츄
속성     전기
색깔     노랑
순위      5
Name: 0, dtype: object

In [16]:
df.iloc[[0]]

    이름  속성  색깔  순위
0  피카츄  전기  노랑   5

In [17]:
df.iloc[[0,2,4]]

    이름  속성    색깔  순위
0  피카츄  전기    노랑   5
2  리자드   불  None   6
4  꼬부기   물    파랑   4

In [19]:
# df.iloc[0,2,4] # Too many indexers # 가져올 행을 전부 []로 묶기
df.iloc[[0,2,4]]

    이름  속성    색깔  순위
0  피카츄  전기    노랑   5
2  리자드   불  None   6
4  꼬부기   물    파랑   4

In [20]:
df.iloc[2:4]

    이름 속성    색깔  순위
2  리자드  불  None   6
3  리자몽  불    빨강   1

In [21]:
# iloc 로 열 가져오기 by 열의 인덱스 번호로 인덱싱
df.iloc[:,0]

0     피카츄
1     라이츄
2     리자드
3     리자몽
4     꼬부기
5    어니부기
Name: 이름, dtype: object

In [23]:
df.iloc[:,[0,2,3]]

     이름    색깔  순위
0   피카츄    노랑   5
1   라이츄    노랑   2
2   리자드  None   6
3   리자몽    빨강   1
4   꼬부기    파랑   4
5  어니부기    파랑   3

In [24]:
df.iloc[:,2:3]

     색깔
0    노랑
1    노랑
2  None
3    빨강
4    파랑
5    파랑

In [25]:
# iloc 로 행렬 동시에 가져오기 by 행,열의 인덱스 번호로 인덱싱
df.iloc[[0,2],[2,3]]

     색깔  순위
0    노랑   5
2  None   6

In [28]:
df.iloc[[0,2],1:3]

   속성    색깔
0  전기    노랑
2   불  None

In [16]:
# loc 로 행 가져오기 by 행 이름으로 인덱싱
df.index = df['이름'] # 행 이름으로 인덱싱 하기 위해서 df.index에 값을 집어넣기
df.index

Index(['피카츄', '라이츄', '리자드', '리자몽', '꼬부기', '어니부기'], dtype='object', name='이름')

In [36]:
df.loc['리자드']

이름     리자드
속성       불
색깔    None
순위       6
Name: 리자드, dtype: object

In [37]:
df.loc[['리자드']]

      이름 속성    색깔  순위
이름
리자드  리자드  불  None   6

In [38]:
df.loc[['리자드', '꼬부기', '어니부기' ]]

        이름    속성    색깔  순위
이름
리자드    리자드     불  None   6
꼬부기    꼬부기     물    파랑   4
어니부기  어니부기  None    파랑   3

In [39]:
df.loc['피카츄' : '꼬부기']

      이름  속성    색깔  순위
이름
피카츄  피카츄  전기    노랑   5
라이츄  라이츄  전기    노랑   2
리자드  리자드   불  None   6
리자몽  리자몽   불    빨강   1
꼬부기  꼬부기   물    파랑   4

In [8]:
# loc 로 열 가져오기 by 열 이름으로 인덱싱
df.loc[:,['이름']]

     이름
0   피카츄
1   라이츄
2   리자드
3   리자몽
4   꼬부기
5  어니부기

In [9]:
df.loc[:,['이름', '순위']]

     이름  순위
0   피카츄   5
1   라이츄   2
2   리자드   6
3   리자몽   1
4   꼬부기   4
5  어니부기   3

In [11]:
df.loc[:,'속성':'순위']

     속성    색깔  순위
0    전기    노랑   5
1    전기    노랑   2
2     불  None   6
3     불    빨강   1
4     물    파랑   4
5  None    파랑   3

In [ ]:
# loc 로 행렬 동시에 가져오기 by 행의 행이름과 열의 열이름으로 인덱싱
df.loc['라이츄':'꼬부기','속성':'순위']

     속성    색깔
이름
라이츄  전기    노랑
리자드   불  None
리자몽   불    빨강
꼬부기   물    파랑

In [23]:
df.loc['피카츄',['속성','색깔']]

속성    전기
색깔    노랑
Name: 피카츄, dtype: object

In [20]:
df.loc[['피카츄','리자몽'],['속성','순위']]

     속성  순위
이름
피카츄  전기   5
리자몽   불   1